app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$B/7Di8L3zTO8PI3i30NnCuEIwvvRfSPLFxegn53CY3Cmc514VTK4.', "remember_token" = 'qi-UJPM-GwqgrD4VM5JFgg', "updated_at" = '2014-05-22 11:16:17.419483' WHERE "users"."id" = 1